NextFOAM-2407/tutorials/combustion/XiDyMFoam/oscillatingCylinder/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|rho|cellDisplacementy)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.1;
        minIter         1;
    }

    "(p|rho|cellDisplacementy)Final"
    {
        $p;
        tolerance       1e-06;
        relTol          0;
        minIter         1;
    }

    "pcorr.*"
    {
        $p;
        tolerance       1e-2;
        relTol          0;
    }

    "(U|b|ft|fu|Su|Xi|ha|hau|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
        minIter         1;
    }

    "(U|b|ft|fu|Su|Xi|ha|hau|k|epsilon)Final"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
        minIter         1;
    }
}

PIMPLE
{
    nOuterCorrectors 2;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
}


// ************************************************************************* //
